let SCEN = [
    '意义这个哲学概念存在于语言如何起作用这个原始的观念之中。但也可以说这是一个关于一种比我们的语言更加原始的语言的观念。让我们设想一种符合于奥古斯丁描述的语言。这种语言被用于在建筑师傅A和他的助手B之间进行交谈。A用各种建筑石料进行建筑。这些石料有：方石、柱石、板石和椽石。B要向A传递石料，并且要按照A需要石料的顺序。为此目的，他们使用了一种由“方石”、“柱石”、“板石”、“椽石”这些词组成的语言。A喊出这些词；——B按照他所学会的那种听到哪种声音就传递哪种石料的方式传递石料。——把这个看做一种完整的原始语言。',
    '我们可以说，奥古斯丁描述了一个交流系统，只是没有把我们称之为语言的全部东西都包括进去。在许多场合，人们必然会这么说，当提出“这种描述是否恰当”这个问题时，回答是：“是的，这种描述是恰当的，但只适用于这个狭窄的限定范围，而不能适用于你原先宣称要描述的全部范围。”这就好比某人这样解释：“游戏就是按照某些规则在一个平面上移动某些东西……”——我们向他回答说：你好像谈的是棋类游戏，然而并非一切游戏都是如此。如果你把这种解释明确地限定在棋类游戏上，那你就能使你的解释变得正确。',
    '设想一种文字，其中的字母被用于代表声音，也作为标志重点和标点的符号。（一种文字可以被看成一种描述声音模式的语言。）再设想某人对这种文字作这样的理解：仿佛字母与声音之间只有相互的对应关系，字母没有其他全然不同的功能。奥古斯丁的语言观就像这样一种过于简单的语言观。',
    '设想有人说：“所有的工具都是用于改变某种东西的。例如，锤子改变钉子的位置，锯子改变木板的形状，等等。”——尺子、胶锅和钉子改变了什么？——“改变我们对事物的长度的知识，改变胶的温度和箱子的稳固性。”——这样地将各种表达式归为一类能够获得什么呢？——',
    '“标志”一词最直接的用法可能就是在被标志的东西上标上一个标记。假设某人A在建筑中所使用的工具都有某种标记，每当A向他的助手出示一种标记，助手就把标有同样标记的工具拿来。一个名称正是以这种方式或类似的方式标志一种东西，从而为这种东西命名。在哲学研究中，我们对自己说给一个东西命名类似于给这个东西贴上一个标记，这种说法往往被证明是有用的。',
    '因此，人们可以说，当已经弄清楚一个词在语言中一般说来应起什么作用时，指物定义就解释了这个词的用法——意义。因此，如果我知道有人想给我解释一个表示颜色的词，那么“这叫‘深棕色’”这种指物解释将有助于我理解这个词。——你可以这么说，只要你不要忘记与“知道”或“清楚”这些词相关联的各种问题。为了能够询问一个东西的名称，人们应该已经知道（或者能够知道）某些事情。但什么是他必须知道的呢？',
    '现在，我们可以用指物的方式为一个人名、颜色的名称、材料的名称、数目的名称以及罗盘方位的名称等下定义。我们指着两个坚果说：“这叫‘2’。”——数字“2”的这个定义非常精确。——然而，人们怎么可以用如此方式给“2”下定义呢？听见这个定义的人并不知道我把什么称为“2”；他会以为你把这堆坚果称为“2”。——他可能这么想，也许不这么想。反过来，当我想给这些坚果一个名称时，他也许把它误解为一个数目的名称。同样，当我用指物的方式解释一个人名时，他也可能把这个人名理解为一种颜色的名称、一个种族的名称，甚至罗盘方位的名称。这就是说，在每一种情况下，都可能对指物定义作不同的解释。',
    '一个来到异国他乡的人有时要通过当地人以指物解释的方式学习当地语言；他往往不得不“猜测”这些解释的意思；有时猜得对，有时猜错了。我想，现在我们可以说，奥古斯丁把人类学习语言的过程描绘成这样：仿佛某个儿童来到一个陌生的地方而且不懂当地的语言，这就是说，仿佛他已经掌握一种语言，只不过不是这一种。换句话说，仿佛这个儿童已经会思考，只是不会说话：“思考”在这里意味着自言自语。',
    '可是，假设某人说：“我在注意形状时总是做同样的动作：我的目光沿着物体的外缘移动，同时我感到……”假设这个人为了给另一个人一个“那个叫做‘圆’”的指物解释而指着一个圆形的物体，并且具有所有这些体验，——那么这另一个人仍然可能对这种解释做不同的理解，即使他看见解释者的目光沿着它的外缘流动，即使他也感觉到解释者的那些感觉。这就是说，这种“解释”可能还包括他在此时如何使用这个被解释的词，例如，当他接到“指向一个圆”这个命令时，他指向什么。——因为，无论“想以如此这般的方式作出解释”，或者“想以如此这般的方式理解解释”，这两种说法都没有标出那个与作出解释和听见解释相伴发生的过程。',
    '让我们想一想在什么情况下我们说游戏是按照特定的规则来玩的。规则也许是用以教别人玩游戏的一种辅助物。学习者被告知规则，并且练习使用规则。——或者，它是游戏本身的一种工具。——或者，规则既不是用于教会别人，也不是用于游戏本身，而且也不把它在一张规则表中记录下来。我们通过观看别人玩游戏而学会玩这种游戏。不过，我们说，由于旁观者能够从实际游戏中看出这些规则，因此这种游戏是按照某种规则来玩的，——就像一条自然法则那样支配着游戏活动。——然而，在这种情况下，旁观者是怎样区分出玩者的错误和正确的玩法呢？——对于这一点，在玩者的行为中有若干特殊的标记。想一想那种用来纠正说错话的行为的特征。即使不懂他的语言，我们也可能辨认出他的这种行为。'
];

let allTitle = [
    '好きな言葉',
    'ブックマーク',
    '色訓練'
];

let bookmarkList = [
                    {meisyou: "youtube", website:'https://www.youtube.com/'}, 
                    {meisyou: '萌绘', website:'https://www.moehui.com/'},
                    {meisyou: '巴哈姆特', website:'https://ani.gamer.com.tw/'},
                    {meisyou: 'pixiv', website:'https://www.pixiv.net/'},
                    {meisyou: 'posemaniacs', website:'https://www.posemaniacs.com/ja/tools/thirtyseconds'},
                    {meisyou: '視覺解刨學', website:'https://visual-anatomy-data.net/index.html'},
                    {meisyou: 'ニコニコ', website:'https://www.nicovideo.jp/'},
                    {meisyou: 'weblio', website:'https://www.weblio.jp/'},
                    {meisyou: 'bookwalker台灣', website:'https://www.bookwalker.com.tw/'},
                    {meisyou: 'bookwalker日本', website:'https://bookwalker.jp/st1/'},
                    {meisyou: 'deepL', website:'https://www.deepl.com/ja/translator'},
                    {meisyou: 'Send to Kindle', website:'https://www.amazon.co.jp/sendtokindle'}
                    ];

let irokunnrennList = [
                       {meisyou: "猜颜色", website:'./iroatari.html'}, 
                       {meisyou: '明度饱和度', website:'./saturationandvalue.html'}
                       ]
